app/Models/ModelLokasi.php

SELECT *
FROM `tbl_lokasi`
---
    public function getAllData()
    {
        return $this->db->table('tbl_lokasi')
        ->get()->getResultArray();