app/Models/ModelAuth.php

SELECT *
FROM `tbl_admin`
WHERE `email` = 'agam11@gmail.com'
AND `password` = '212121'
---
    public function login($email,$password)
    {
        return $this->db->table('tbl_admin')->where(
            [
                'email' => $email,
                'password' => $password
            ]
        )->get()->getRowArray();

SELECT *
FROM `tbl_admin`
---
    public function getAllData()
    {
        return $this->db->table('tbl_admin')
        ->get()->getResultArray();